API Endpoints.txt

SOAP Endpoint API: https://www.dataaccess.com/webservicesserver/NumberConversion.wso
 
Inside Postman:
 > Set the Request Type to POST
 > Keep the Header as:
	Key: Content-Type
	Value: text/xml
 > Paste this in the body:
	<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.dataaccess.com/webservicesserver/">
    <soapenv:Header/>
    <soapenv:Body>
        <web:NumberToWords>
            <web:ubiNum>123</web:ubiNum>
        </web:NumberToWords>
    </soapenv:Body>
</soapenv:Envelope>

REST Endpoint URL: https://jsonplaceholder.typicode.com/posts/1

GraphQL Endpoint URL: https://countries.trevorblades.com/graphql?Content-type=application/json
> 
{
  "query": "{ country(code: \"AD\") { name } }"
}
